app/views/comments/_comment.html.erb

SELECT "comments".* FROM "comments" WHERE "comments"."article_id" = ?  [["article_id", 9]]
---
<%= @article.comments.each do |comment| %>